#include <iostream>

/**
 * Есть файл каждая строка которого имеет формат:
 * вершина:расстояние:вершина.
 * Вершины - это вершины графа, расстояние - это расстояние между данными вершинами.
 * Требуется написать программу, которая будет на вход получать данный файл и номера двух вершин,
 * а на выходе выдавать минимальное расстояние между вершинами
 * и распечатывать маршрут между данными вершинами.
 */
int main(int argc, char *argv[]) {
    std::cout << "Hello, World!" << std::endl;
    return 0;
}